Tekla.Structures.Analysis.AnalysisEccentricity
The AnalysisEccentricity class contains eccentricity information for an analysis model.

Tekla.Structures.Analysis.AnalysisEccentricity._Start
Start.

Tekla.Structures.Analysis.AnalysisEccentricity._End
End.

Tekla.Structures.Analysis.AnalysisEccentricity.#ctor
Creates a new analysis eccentricity instance.

Tekla.Structures.Analysis.AnalysisEccentricity.Start
The eccentricity at the start.

Tekla.Structures.Analysis.AnalysisEccentricity.End
The eccentricity at the end.